# ProjectId Property (2022)

---
C#Visual BasicVisual C++
Revit 2022 API
---
SetupEnergySimulationDialog..::..ProjectId Property
SetupEnergySimulationDialog Class See Also
---
The identifier of the project (on the Green Building Studio server) that was selected by the user.
**Namespace:** Autodesk.Revit.UI**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 22.0.0.0 (22.1.0.0)**Since:** 2016
# Syntax
C#
---
```text
public int ProjectId { get; }
```

Visual Basic
---
```text
Public ReadOnly Property ProjectId As Integer
	Get
```

Visual C++
---
```text
public:
property int ProjectId {
	int get ();
}
```

# Remarks
This value is only valid after Show()()()() has been called. A negative value indicates that no project was selected.
# See Also
SetupEnergySimulationDialog Class
Autodesk.Revit.UI Namespace